In [16]:
print("Hello World")

Hello World

# This is a title 

This is my notes

In [17]:
import pandas as pd
import numpy as np

from sklearn.datasets import fetch_openml

In [54]:
titanic = fetch_openml(name='titanic', version=1, as_frame=True)
df = titanic.frame
df.head()

c:\ProgramData\anaconda3\Lib\site-packages\sklearn\datasets\_openml.py:968: FutureWarning: The default value of `parser` will change from `'liac-arff'` to `'auto'` in 1.4. You can set `parser='auto'` to silence this warning. Therefore, an `ImportError` will be raised from 1.4 if the dataset is dense and pandas is not installed. Note that the pandas parser may return different data types. See the Notes Section in fetch_openml's API doc for details.
  warn(
c:\ProgramData\anaconda3\Lib\site-packages\sklearn\datasets\_arff_parser.py:200: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.
  frame = pd.concat(dfs, ignore_index=True)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,None,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,None,135.0,"Montreal, PQ / Chesterville, ON"
4,1.0,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,None,NaN,"Montreal, PQ / Chesterville, ON"

In [55]:
# Check for missing values and handle them
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   float64
 1   survived   1309 non-null   category
 2   name       1309 non-null   object
 3   sex        1309 non-null   category
 4   age        1046 non-null   float64
 5   sibsp      1309 non-null   float64
 6   parch      1309 non-null   float64
 7   ticket     1309 non-null   object
 8   fare       1308 non-null   float64
 9   cabin      295 non-null    object
 10  embarked   1307 non-null   category
 11  boat       486 non-null    object
 12  body       121 non-null    float64
 13  home.dest  745 non-null    object
dtypes: category(3), float64(6), object(5)
memory usage: 116.8+ KB

In [56]:
missing_values = df.isnull().sum()
missing_values

pclass          0
survived        0
name            0
sex             0
age           263
sibsp           0
parch           0
ticket          0
fare            1
cabin        1014
embarked        2
boat          823
body         1188
home.dest     564
dtype: int64

In [57]:
# Handling the missing values
median_age = df['age'].median()
df['age'].fillna(median_age, inplace=True)

In [58]:
df.isnull().sum()

pclass          0
survived        0
name            0
sex             0
age             0
sibsp           0
parch           0
ticket          0
fare            1
cabin        1014
embarked        2
boat          823
body         1188
home.dest     564
dtype: int64

In [59]:
# 2. Check for duplicates and removing them
df.duplicated().sum()

0

In [60]:
# 3. 

df.sex.value_counts()

df['sex'] = df.sex.str.upper()

df.sex.value_counts()

sex
MALE      843
FEMALE    466
Name: count, dtype: int64

In [61]:
# 4. Detect outliers in the Age and Fare cols
# OUTLIERS > 1.5*IQR

Q1_age = df['age'].quantile(0.25)
Q3_age = df['age'].quantile(0.75)
IQR_age = Q3_age - Q1_age

Q1_fare = df['fare'].quantile(0.25)
Q3_fare = df['fare'].quantile(0.75)
IQR_fare = Q3_fare - Q1_fare

print(IQR_age, IQR_fare)

13.0 23.379199999999997

In [62]:
age_outliers = df[(df['age'] < (Q1_age - 1.5*IQR_age)) | (df['age'] > (Q3_age + 1.5*IQR_age))]
fare_outliers = df[(df['fare'] < (Q1_fare - 1.5*IQR_fare)) | (df['fare'] > (Q3_fare + 1.5*IQR_fare))]

In [63]:
# Seeing the above
fare_outliers.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1,"Allen, Miss. Elisabeth Walton",FEMALE,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1,"Allison, Master. Hudson Trevor",MALE,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0,"Allison, Miss. Helen Loraine",FEMALE,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,None,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0,"Allison, Mr. Hudson Joshua Creighton",MALE,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,None,135.0,"Montreal, PQ / Chesterville, ON"
4,1.0,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",FEMALE,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,None,NaN,"Montreal, PQ / Chesterville, ON"

In [64]:
# 5. Create a new "Family Size" based on "SibSp" and "Parch".
df['family_size'] = df['sibsp'] + df['parch'] + 1
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,family_size
0,1.0,1,"Allen, Miss. Elisabeth Walton",FEMALE,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO",1.0
1,1.0,1,"Allison, Master. Hudson Trevor",MALE,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON",4.0
2,1.0,0,"Allison, Miss. Helen Loraine",FEMALE,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,None,NaN,"Montreal, PQ / Chesterville, ON",4.0
3,1.0,0,"Allison, Mr. Hudson Joshua Creighton",MALE,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,None,135.0,"Montreal, PQ / Chesterville, ON",4.0
4,1.0,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",FEMALE,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,None,NaN,"Montreal, PQ / Chesterville, ON",4.0

In [65]:
# 6. Encode the embarked col
from sklearn.preprocessing import LabelEncoder

label_encoder = LabelEncoder()

df['embarked_encoded'] = label_encoder.fit_transform(df['embarked'])
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,family_size,embarked_encoded
0,1.0,1,"Allen, Miss. Elisabeth Walton",FEMALE,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO",1.0,2
1,1.0,1,"Allison, Master. Hudson Trevor",MALE,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON",4.0,2
2,1.0,0,"Allison, Miss. Helen Loraine",FEMALE,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,None,NaN,"Montreal, PQ / Chesterville, ON",4.0,2
3,1.0,0,"Allison, Mr. Hudson Joshua Creighton",MALE,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,None,135.0,"Montreal, PQ / Chesterville, ON",4.0,2
4,1.0,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",FEMALE,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,None,NaN,"Montreal, PQ / Chesterville, ON",4.0,2

In [66]:
df['embarked_encoded'].value_counts()

embarked_encoded
2    914
0    270
1    123
3      2
Name: count, dtype: int64

In [67]:
df['embarked'].unique()

['S', 'C', NaN, 'Q']
Categories (3, object): ['C', 'Q', 'S']

In [71]:
# One Hot Encoding

df['embarked_S'] = df.apply(
    lambda row: 1 if (row['embarked']=='S') else 0,
    axis=1
)

df['embarked_C'] = df.apply(
    lambda row: 1 if (row['embarked']=='C') else 0,
    axis=1
)

df['embarked_Q'] = df.apply(
    lambda row: 1 if (row['embarked']=='Q') else 0,
    axis=1
)
df.head(n=10)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,family_size,embarked_encoded,embarked_S,embarked_C,embarked_Q
0,1.0,1,"allen, elisabeth walton",FEMALE,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO",1.0,2,1,0,0
1,1.0,1,"allison, hudson trevor",MALE,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON",4.0,2,1,0,0
2,1.0,0,"allison, helen loraine",FEMALE,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,None,NaN,"Montreal, PQ / Chesterville, ON",4.0,2,1,0,0
3,1.0,0,"allison, hudson joshua creighton",MALE,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,None,135.0,"Montreal, PQ / Chesterville, ON",4.0,2,1,0,0
4,1.0,0,"allison, hudson j c (bessie waldo daniels)",FEMALE,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,None,NaN,"Montreal, PQ / Chesterville, ON",4.0,2,1,0,0
5,1.0,1,"anderson, harry",MALE,48.0000,0.0,0.0,19952,26.5500,E12,S,3,NaN,"New York, NY",1.0,2,1,0,0
6,1.0,1,"andrews, kornelia theodosia",FEMALE,63.0000,1.0,0.0,13502,77.9583,D7,S,10,NaN,"Hudson, NY",2.0,2,1,0,0
7,1.0,0,"andrews, thomas jr",MALE,39.0000,0.0,0.0,112050,0.0000,A36,S,None,NaN,"Belfast, NI",1.0,2,1,0,0
8,1.0,1,"appleton, edward dale (charlotte lamson)",FEMALE,53.0000,2.0,0.0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY",3.0,2,1,0,0
9,1.0,0,"artagaveytia, ramon",MALE,71.0000,0.0,0.0,PC 17609,49.5042,None,C,None,22.0,"Montevideo, Uruguay",1.0,0,0,1,0

In [72]:
# 8. Clean the Name 
import re

df['name'] = df['name'].apply(
    lambda x: re.sub(r'(Mr\.|Mrs\.|Dr\.|Miss\.|Master\.)', '', x) 
)

df['name'] = df.name.str.lower()

df.head(n=10)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,family_size,embarked_encoded,embarked_S,embarked_C,embarked_Q
0,1.0,1,"allen, elisabeth walton",FEMALE,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO",1.0,2,1,0,0
1,1.0,1,"allison, hudson trevor",MALE,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON",4.0,2,1,0,0
2,1.0,0,"allison, helen loraine",FEMALE,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,None,NaN,"Montreal, PQ / Chesterville, ON",4.0,2,1,0,0
3,1.0,0,"allison, hudson joshua creighton",MALE,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,None,135.0,"Montreal, PQ / Chesterville, ON",4.0,2,1,0,0
4,1.0,0,"allison, hudson j c (bessie waldo daniels)",FEMALE,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,None,NaN,"Montreal, PQ / Chesterville, ON",4.0,2,1,0,0
5,1.0,1,"anderson, harry",MALE,48.0000,0.0,0.0,19952,26.5500,E12,S,3,NaN,"New York, NY",1.0,2,1,0,0
6,1.0,1,"andrews, kornelia theodosia",FEMALE,63.0000,1.0,0.0,13502,77.9583,D7,S,10,NaN,"Hudson, NY",2.0,2,1,0,0
7,1.0,0,"andrews, thomas jr",MALE,39.0000,0.0,0.0,112050,0.0000,A36,S,None,NaN,"Belfast, NI",1.0,2,1,0,0
8,1.0,1,"appleton, edward dale (charlotte lamson)",FEMALE,53.0000,2.0,0.0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY",3.0,2,1,0,0
9,1.0,0,"artagaveytia, ramon",MALE,71.0000,0.0,0.0,PC 17609,49.5042,None,C,None,22.0,"Montevideo, Uruguay",1.0,0,0,1,0